---
---
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<html>
  <head>
    <title>syntax-and-semantic.org</title>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <style type="text/css">
    <!--
      body {
        color: #f8f8f0;
        background-color: #1b1d1e;
      }
      .bold {
        /* bold */
        font-weight: bold;
      }
      .org-document-info {
        /* org-document-info */
        color: #afeeee;
      }
      .org-document-info-keyword {
        /* org-document-info-keyword */
        color: #b3b3b3;
      }
      .org-document-title {
        /* org-document-title */
        color: #afeeee;
        font-weight: bold;
      }
      .org-level-1 {
        /* org-level-1 */
        color: #a6e22e;
      }

      a {
        color: inherit;
        background-color: inherit;
        font: inherit;
        text-decoration: inherit;
      }
      a:hover {
        text-decoration: underline;
      }
    -->
    </style>
{% include in-org-head.html %}
  </head>
  <body>
    {% include before-pre.html %}
<pre>
<span class="org-document-info-keyword">#+TITLE:</span>  <span class="org-document-title">&#35486;&#27861;&#33287;&#35486;&#32681; / syntax and semantic
</span><span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">&#35613;&#23431;&#24646; / XIE Yuheng
</span><span class="org-document-info-keyword">#+EMAIL:</span>  <span class="org-document-info">xyheme@gmail.com
</span>
<span class="org-level-1">* &#21517;</span>
  * &#20309;&#29234;&#35486;&#32681;
    &#20309;&#29234;&#35486;&#27861;
  * &#22914;&#26524;&#21482;&#26159;&#21934;&#32020;&#22320;&#21839;&#20986;&#19978;&#38754;&#30340;&#21839;&#38988;&#30340;&#35441;
    &#25105;&#20063;&#27794;&#27861;&#22238;&#31572;
  * &#36889;&#26159;&#22240;&#29234;&#36889;&#20841;&#20491;&#35422;&#22312;&#21508;&#31278;&#35486;&#22659;&#19979;&#34987;&#28651;&#29992;&#20102;
    &#22312;&#19981;&#21516;&#30340;&#35486;&#22659;&#19979;
    &#19981;&#21516;&#30340;&#20316;&#32773;&#20351;&#29992;&#23427;&#20497;&#30340;&#26178;&#20505;
    &#25152;&#25351;&#30340;&#24120;&#24120;&#26159;&#19981;&#21516;&#30340;&#27010;&#24565;
  * &#36889;&#20841;&#20491;&#35422;&#26159;&#38750;&#24120;&#20856;&#22411;&#30340;&#36935;&#21040;&#36889;&#31278;&#22256;&#22659;&#30340;&#34899;&#35486;
    &#27492;&#26178;&#22914;&#26524;&#24819;&#20351;&#35342;&#35542;&#35722;&#24471;&#26377;&#24847;&#32681;
    &#35342;&#35542;&#32773;&#24517;&#38920;&#25226;&#36889;&#20841;&#20491;&#35422;&#30340;&#24847;&#32681;
    &#38480;&#21046;&#21040;&#26356;&#20855;&#39636;&#30340;&#35486;&#22659;&#20013;
<span class="org-level-1">* &#23450;&#32681;</span>
  &#22240;&#27492;
  &#25105;&#22039;&#35430;&#20570;&#22914;&#19979;&#30340;&#23450;&#32681;
  1. <span class="bold">*&#20449;&#24687;*</span> &#22312;&#26044; <span class="bold">*&#21312;&#20998;*</span>
     &#21482;&#26377;&#30070;&#20841;&#20491;&#20154;&#37117;&#26377;&#33021;&#21147;&#21312;&#20998; &#32005; &#21644; &#34253; &#20043;&#26178;
     &#36889;&#20841;&#20491;&#20154;&#25165;&#33021;&#20351;&#29992; &#32005; &#34253; &#20841;&#31278;&#38991;&#33394;&#30340;&#20809;&#20358;&#20659;&#36958;&#20449;&#24687;
     &#21448;&#27604;&#22914;
     &#25105;&#20497;&#21487;&#20197;&#25226; &#20219;&#24847;&#19968;&#20491;&#29289;&#39636; &#30340;&#20841;&#31278;&#21487;&#21312;&#20998;&#30340;&#29376;&#24907;
     &#31281;&#20316; <span class="bold">*&#19968;&#27604;&#29305;*</span>
     &#28982;&#24460;&#25105;&#20497;&#23601;&#21487;&#20197;&#20197; <span class="bold">*&#27604;&#29305;*</span> &#29234;&#21934;&#20301;&#20358;&#24230;&#37327;&#20449;&#24687;&#20102;
  2. &#36889;&#35023;&#30340; <span class="bold">*&#20841;&#20491;&#20154;*</span> &#20854;&#23526;&#21487;&#20197;&#20855;&#26356;&#24291;&#27867;&#30340;&#24847;&#32681;
     &#27604;&#22914;&#27231;&#22120;&#21644;&#20154;&#20043;&#38291;&#30340;&#20449;&#24687;&#20659;&#36958;&#20063;&#21487;&#20197;&#22312;&#36889;&#20491;&#27169;&#22411;&#20013;&#29702;&#35299;
  3. <span class="bold">*&#35486;&#27861;*</span> &#26159; <span class="bold">*&#20449;&#24687;&#30340;&#32080;&#27083;*</span>
     &#21482;&#26377;&#30070;&#20841;&#20491;&#20154;&#33021;&#22816;&#20659;&#36958;&#32102;&#23565;&#26041;&#32080;&#27083;&#21270;&#30340;&#20449;&#24687;
     &#20006;&#19988;&#23427;&#20497;&#20351;&#29992;&#30456;&#21516;&#30340; &#25110;&#30456;&#20284;&#30340; &#26041;&#24335;&#20358;&#29702;&#35299;&#20854;&#32080;&#27083;&#26178;
     &#25105;&#20497;&#25165;&#26371;&#25226;&#20182;&#20497;&#20114;&#30456;&#20659;&#36958;&#20449;&#24687;&#30340;&#34892;&#29234;&#31281;&#20316;&#26159; <span class="bold">*&#20132;&#27969;*</span> &#25110; <span class="bold">*&#36890;&#35338;*</span>
  4. &#22312;&#19978;&#38754;&#23565;&#35486;&#27861;&#30340;&#23450;&#32681;&#20013;
     &#36996;&#26377;&#19968;&#20491;&#19981;&#26131;&#29702;&#35299;&#30340;&#35422;
     &#21363; <span class="bold">*&#29702;&#35299;*</span> &#36889;&#20491;&#35422;
  5. &#22312;&#20659;&#32113;&#30340;&#25976;&#23416;&#20013;&#26377;&#20123;&#35422;&#21644;&#27010;&#24565;&#34987;&#31281;&#20316;&#26159;&#20844;&#29702;
     &#32780;&#22312; <span class="bold">*&#24418;&#24335;&#20027;&#32681;*</span> &#30340;&#31526;&#34399;&#21270;&#30340;&#25976;&#23416;&#32080;&#27083;&#20013;
     &#20063;&#32317;&#26371;&#25351;&#23450;&#19968;&#20491;&#19981;&#32147;&#23450;&#32681;&#30340;&#31526;&#34399;&#30340;&#38598;&#21512;
     &#25105;&#20497;&#21487;&#20197;&#26283;&#26178;&#25226; <span class="bold">*&#29702;&#35299;*</span> &#36889;&#20491;&#35422;&#29702;&#35299;&#29234; &#20844;&#29702;&#24615;&#30340;
     &#28982;&#24460;&#21033;&#29992;&#23427;&#20358;&#23450;&#32681; <span class="bold">*&#35486;&#32681;*</span>
  6. &#30070;&#36899;&#20491;&#20154;&#24444;&#27492;&#20132;&#27969;&#26178;
     &#25105;&#31281;&#20182;&#20497;&#25152;&#20351;&#29992;&#30340;&#30456;&#21516;&#30340; &#25110;&#30456;&#20284;&#30340; &#29702;&#35299;&#20449;&#24687;&#30340;&#32080;&#27083;&#30340;&#26041;&#24335;
     &#29234; <span class="bold">*&#35486;&#27861;&#30340;&#35486;&#32681;*</span>
  7. &#22312;&#35486;&#35328;&#23416;&#20013;
     &#25105;&#20497;&#35264;&#23519; &#25105;&#20497;&#22312;&#26085;&#24120;&#29983;&#27963;&#20013; &#25152;&#20659;&#36958;&#32102;&#20182;&#20154;&#30340;&#20449;&#24687;&#30340; &#32080;&#27083;
  8. &#32780;&#30070;&#32232;&#31243;&#26178;
     &#25105;&#35373;&#35336;&#20449;&#24687;&#30340;&#26032;&#30340;&#32080;&#27083;
     &#20197;&#29992;&#20358;&#33287;&#27231;&#22120;&#20132;&#27969; &#25110;&#25511;&#21046;&#27231;&#22120;
  9. &#25152;&#20197;&#30070;&#25105;&#35498; <span class="bold">*&#25105;&#29234;&#34796;&#35486;&#35373;&#35336;&#20102;&#26032;&#30340; &#955;-&#28436;&#31639; &#30340;&#35486;&#27861;*</span> &#26178;
     &#20320;&#26126;&#30333;&#20102;
     &#36889;&#23601;&#26159;&#22312;&#35498;
     &#25105;&#35373;&#35336;&#20102;&#26032;&#30340;&#32080;&#27083;&#21270;&#30340;&#20449;&#24687;
     &#30070;&#25105;&#22312;&#25226;&#36889;&#20123;&#32080;&#27083;&#21270;&#30340;&#20449;&#24687;&#20659;&#36958;&#32102;&#34796;&#35486;&#30340;&#26855;&#27231;&#26178;
     &#34796;&#35486;&#30340;&#26855;&#27231;&#23559;&#24171;&#25105;&#23436;&#25104; &#955;-&#28436;&#31639;
  10. &#21487;&#20197;&#30332;&#29694;
      &#30070;&#35342;&#35542; <span class="bold">*&#29992;&#31243;&#24207;&#35486;&#35328;&#33287;&#27231;&#22120;&#20132;&#27969;*</span> &#26178;
      &#25105;&#20497;&#20854;&#23526;&#21487;&#20197;&#19981;&#25226; <span class="bold">*&#29702;&#35299;*</span> &#29702;&#35299;&#29234;&#20844;&#29702;&#24615;&#30340;&#35422;
      &#32780;&#36914;&#19968;&#27493;&#22320;&#23450;&#32681;&#36889;&#20491;&#35422;
      &#20197;&#22039;&#35430;&#21435;&#20197;&#26356;&#20855;&#39636;&#30340;&#26041;&#24335;&#20358;&#29702;&#35299;&#23427;
      &#36889;&#31278;&#22039;&#35430;&#23601;&#30041;&#32102;&#25105;&#30340;&#35712;&#32773;&#20358;&#20570;&#20102;
      &#25105;&#35469;&#29234;
      &#30070;&#35342;&#35542;&#33287;&#27231;&#22120;&#30340;&#20132;&#27969;&#26178;
      &#25105;&#20497;&#20043;&#25152;&#20197;&#33021;&#22816;&#36914;&#19968;&#27493;&#22320;&#20855;&#39636;&#21270;&#26576;&#20123;&#27010;&#24565;
      &#26159;&#22240;&#29234;&#25105;&#20497;&#24050;&#32147;&#26377;&#24456;&#22810;&#25976;&#23416;&#29702;&#35542;&#20358;&#24171;&#21161;&#25105;&#20497;&#29702;&#35299;&#27231;&#22120;&#30340;&#36939;&#20316;&#20102;
      &#32780;&#23565;&#26044;&#20154;&#33126;&#30340;&#31070;&#32147;&#31995;&#32113;&#30340;&#36939;&#20316;&#26041;&#24335;
      &#25105;&#20497;&#36996;&#30693;&#20043;&#29978;&#23569;
<span class="org-level-1">* the words</span>
  * what is semantic?
    and what is syntax?
  * if you just ask these two questions as above.
    for real.
    I have to admit that nor do I know the answers.
  * that is because
    these two words had been used
    in too many contexts in history.
    and in different contexts
    they are very likely to have different meanings.
  * these two words
    are very typical terminologys
    that meet this kind of situation,
    of which when one wants to make
    one's discussion meaningful,
    one has to restrict the meanings of these two words
    into certain contexts.
<span class="org-level-1">* to define</span>
  therefore,
  I try to make the following definitions of these two words,
  to make our discussion meaningful.
  1. information is about to distinguish.
     only when two are both able to distinguish red and blue,
     then, two can send informations to each other by lights of these two colors.
     for example, we may call two distinguishable state of any kinds of physical object that we can send to each others -- "one bit",
     and we use "bit" as an unit to measure informations.
  2. you note that I use the word "two" instead of "two dolphins" or "two cicadas" or "two machines",
     it is because I mean to denote the general.
  3. syntaxes are structures of informations.
     only when two are able to send each other structured informations;
     and they use the same way (or similar ways) to understand the structures,
     then, we may call the actions of sending each other informations -- the communications between these two.
     for example, you might not able to communicate with me by Chinese text,
     for you do not use the same way (or a similar way)
     to understand the structures of Chinese text
     as the way I use to understand them.
  4. normal person will simply say that you do not speak Chinese.
     I can not say that, because :
     1. I am not normal.
     2. the structures of Chinese phonemes (Chinese speech sounds)
        and the structures of Chinese graphemes (Chinese chars)
        are highly (but not totally) separated, you can understand one of them but do not understand the other.
        this is the major reason that keeps China a big Central Empire,
        for when a Northern can not understand what a Southern say,
        he or she can still understand what a Southern write,
        this is because the structures of speech sounds change much rapidly then the structures of chars.
  5. there is still one verb which is hard to understand in the above definition of "syntax".
     that is just the verb "understand".
  6. you know, in math, or in a dictionary of some language,
     people always choose some words as undefined-primitive-words.
     with these undefined-primitive-words, the math can still forms a system (or many systems),
     and a dictionary can still be useful to people.
     let us temporarily choose "understand" as an undefined-primitive-word,
     and use it to define "semantic".
  7. when two communicate with each other,
     I call the way (or the similar ways) they use to understand
     the structures of the informations that they send to each other
     -- the semantics of the syntaxes (or of the structures of the informations).
  8. in linguistics, we study the structures of the informations we sent to each others in normal life.
     or, one may say that we study the structures of natural language.
  9. when programming,
     I design new structures of the informations
     that we can use to communicate (or control) the machines.
     or, one may say that I design computer programming language :)
  10. so, when I say that I had designed new syntax about lambda-calculus in cicada language,
      you know now, it is to say that I had designed a new structure of the informations
      that I can send to computers in cicada language,
      and when I send the informations to computers,
      they will do something that called "lambda-calculus" for me.
  11. you see, when talk about communicate with computers,
      we actually can not to choose the verb "understand" as an undefined-primitive-word,
      instead we can easily define this verb even further.
      I leave this definition to you -- my dear reader,
      and I can tell you,
      the reason that let us achieve this,
      is simply for we understand how machines "understand" things far better
      then we understand how human understand things.
      actually, we understand machines not much at all,
      but it is just that we understand human brains even less.
</pre>
  </body>
</html>
